LiteOS/LiteOS/platform/STM32F412ZG-NUCLEO/los_bsp_uart.h
#ifndef _LOS_BSP_UART_H
#define _LOS_BSP_UART_H

#ifdef LOS_STM32F412Zx


#include "stm32f4xx_hal.h"
#include "stm32f4xx_nucleo_144.h"

#define USARTx                              USART6
#define USARTx_CLK_ENABLE()                 __HAL_RCC_USART6_CLK_ENABLE()
#define USARTx_RX_GPIO_CLK_ENABLE()         __HAL_RCC_GPIOC_CLK_ENABLE()
#define USARTx_TX_GPIO_CLK_ENABLE()         __HAL_RCC_GPIOC_CLK_ENABLE()

#define USARTx_FORCE_RESET()                __HAL_RCC_USART6_FORCE_RESET()
#define USARTx_RELEASE_RESET()              __HAL_RCC_USART6_RELEASE_RESET()

/* Definition for USARTx Pins */
#define USARTx_TX_PIN                       GPIO_PIN_6
#define USARTx_TX_GPIO_PORT                 GPIOC
#define USARTx_TX_AF                        GPIO_AF8_USART6
#define USARTx_RX_PIN                       GPIO_PIN_7
#define USARTx_RX_GPIO_PORT                 GPIOC
#define USARTx_RX_AF                        GPIO_AF8_USART6

/* Size of Trasmission buffer */
#define TXBUFFERSIZE                        (COUNTOF(aTxBuffer) - 1)
/* Size of Reception buffer */
#define RXBUFFERSIZE                        TXBUFFERSIZE
  
/* Exported macro ------------------------------------------------------------*/
#define COUNTOF(__BUFFER__)   (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))
/* Exported functions ------------------------------------------------------- */

#endif

void LOS_EvbUartInit(void);
void LOS_EvbUartWriteByte(char c);
void LOS_EvbUartWriteStr(const char* str);
void LOS_EvbUartReadByte(char* c);

#endif
